In [1]:
import pandas as pd
import numpy as np

In [22]:
df = pd.read_csv('data/stuscore.csv',index_col='번호')

In [24]:
# 합계,평균 컬럼을 추가하고 평점 90점 미만은 데이터를 삭제하고 출력하시오.
df['합계'] = df['국어']+df['영어']+df['수학']
df['평균'] = df['합계'] / 3
# filt = df['평균']<90
# filt

# df.drop(index=df[filt].index,inplace=True)
# df.count()

### df2를 가지고 다시 검색
# df2 = df[df['평균']>90]
# df2

In [14]:
df.columns

Index(['이름', '국어', '영어', '수학', '합계', '평균'], dtype='object')

컬럼순서 변경

In [ ]:
### 컬럼순서를 변경해서 다시 입력시킴.
df = df[['이름', '평균', '국어', '영어', '수학', '합계']]
df.head(2)

     이름    평균  국어  영어  수학   합계
번호
1   홍길동  75.0  71  80  74  225
2   유관순  73.0  53  91  75  219

In [31]:
df.columns

Index(['이름', '국어', '영어', '수학', '합계', '평균'], dtype='object')

In [35]:
col = list(df.columns)
col

['이름', '국어', '영어', '수학', '합계', '평균']

In [39]:
df[[col[0]]+col[1:-1]]

          이름  국어  영어  수학   합계
번호
1        홍길동  71  80  74  225
2        유관순  53  91  75  219
3        이순신  53  83  78  214
4        강감찬  91  58  83  232
5         김구  83  97  86  266
..       ...  ..  ..  ..  ...
96    Robbie  50  99  92  241
97    Farica  93  84  67  244
98    Janean  53  99  61  213
99   Dorothy  59  62  68  189
100    Abbot  72  72  68  212

[100 rows x 5 columns]